artillery/shortEndpoints/createShort.yaml
config:
    target: http://tukano-1730835561603.azurewebsites.net/tukano/rest
    phases:
        - name: create_short
          duration: 1
          arrivalRate: 3
    payload:
        path: ../data/users.csv
        order: sequence # selects users sequentially, default is random
        #loadAll: true # load the whole CSV
        skipHeader: true # The first line is a header, so we want to skip it
        delimiter: "," # standard delimiter
        skipEmptyLines: true # not important in our case
        fields:
            - "id"
            - "pwd"
            - "email"
            - "displayName"

scenarios:
    - name: TuKanoCreateShort
      flow:
        - post:
            url: /shorts/{{ id }}?pwd={{ pwd }}
            headers:
                Content-Type: application/json