artillery/shortEndpoints/deleteShort.yaml
config:
    target: http://tukano-1730835561603.azurewebsites.net/tukano/rest
    plugins:
        metrics-by-endpoint: {} # Used to get metrics for each endpoint individually.
    processor: ./test-utils.js
    phases:
        - name: delete_short
          duration: 1
          arrivalRate: 1
    payload:
        path: ../data/users.csv
        order: sequence # selects users sequentially, default is random
        #loadAll: true # load the whole CSV
        skipHeader: true # The first line is a header, so we want to skip it
        delimiter: "," # standard delimiter
        skipEmptyLines: true # not important in our case
        fields:
            - "id"
            - "pwd"
            - "email"
            - "displayName"
            
beforeSection:
    - name: TuKanoCreateShort
      flow:
        - post:
            url: /shorts/{{ id }}?pwd={{ pwd }}
            headers:
                Content-Type: application/json
            json:
                id: "{{ id }}" # this parameter is filled from the fields above
                pwd: "{{ pwd }}"
            capture:
                - json: $.id
                  as: shortId


scenarios:
    - name: TuKanoDeleteShort
      flow:
        - get:
            url: /shorts/{{ shortId }}
            headers:
                Content-Type: application/json
            afterResponse: "processDeleteReply"