artillery/shortEndpoints/getShorts.yaml
config:
    target: http://tukano-1730835561603.azurewebsites.net/tukano/rest
    plugins:
        metrics-by-endpoint: {} # Used to get metrics for each endpoint individually.
    processor: ./test-utils.js
    phases:
        - name: get_short
          duration: 1
          arrivalRate: 3
    payload:
        path: ../data/users.csv
        order: sequence # selects users sequentially, default is random
        #loadAll: true # load the whole CSV
        skipHeader: true # The first line is a header, so we want to skip it
        delimiter: "," # standard delimiter
        skipEmptyLines: true # not important in our case
        fields:
            - "id"
            - "pwd"
            - "email"
            - "displayName"

scenarios:
    - name: TuKanoGetShorts
      flow:
        - get:
            url: /shorts/{{ id }}
            headers:
                Content-Type: application/json